src/main/resources/xmls/salesforcequery/CreateTGSOpportunityAtSolutioning.xml

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
	<Header>
		<SessionHeader xmlns="urn:partner.soap.sforce.com">
			<sessionId></sessionId>
		</SessionHeader>
	</Header>
	<Body>
		<create xmlns="urn:partner.soap.sforce.com">
			<sObjects>

				<type xmlns="urn:sobject.partner.soap.sforce.com">Opportunity</type>
				<Name xmlns="">TestTGSOpportunity</Name>
				<CloseDate xmlns=""></CloseDate>
				<AccountId xmlns=""></AccountId>
				<StageName xmlns=""></StageName>
				<RecordTypeId xmlns=""></RecordTypeId>
				<Segment__c xmlns=""></Segment__c>
				<Organization_Office__c	 xmlns=""></Organization_Office__c>
				<Sales_Organization__c xmlns=""></Sales_Organization__c>
				<Regional_Director__c xmlns=""></Regional_Director__c>
				<Practice_Engagement__c xmlns=""></Practice_Engagement__c>
				<Primary_Service_Type__c xmlns=""></Primary_Service_Type__c>
				<Describe_Customer_Pain__c xmlns=""></Describe_Customer_Pain__c>
				<Channel_Partners__c xmlns=""></Channel_Partners__c>
				<Start_Date__c xmlns=""></Start_Date__c>
				<Validate_Total_Revenue_Life_of_Deal__c xmlns=""></Validate_Total_Revenue_Life_of_Deal__c>
				<NextStep xmlns=""></NextStep>
				<DeliveryModel__c xmlns=""></DeliveryModel__c>
				<Client_Relationship__c xmlns=""></Client_Relationship__c>
				<Global_Services_Opportunity_Type__c xmlns=""></Global_Services_Opportunity_Type__c>
				<Response_Type__c xmlns=""></Response_Type__c>
				<Originating_Opportunity__c xmlns=""></Originating_Opportunity__c>
				<Vertical__c xmlns=""></Vertical__c>
				<How_will_we_win__c xmlns=""></How_will_we_win__c>
				<Desired_Business_Outcomes__c xmlns=""></Desired_Business_Outcomes__c>
				<Business_Sponsor_Name__c xmlns=""></Business_Sponsor_Name__c>
				<Business_Sponsor_Title__c xmlns=""></Business_Sponsor_Title__c>
				<Economic_Buyer_Name__c xmlns=""></Economic_Buyer_Name__c>
				<Economic_Buyer_Title__c xmlns=""></Economic_Buyer_Title__c>
				<IT_Sponsor_Name__c xmlns=""></IT_Sponsor_Name__c>
				<IT_Sponsor_Title__c xmlns=""></IT_Sponsor_Title__c>
				<Procurement_Name__c xmlns=""></Procurement_Name__c>
				<Procurement_Title__c xmlns=""></Procurement_Title__c>
				<Is_credit_approved__c xmlns=""></Is_credit_approved__c>
				<Deal_Owner__c xmlns=""></Deal_Owner__c>
				<Product__c xmlns=""></Product__c>
				<Probability xmlns=""></Probability>
				<Probability_TGS__c xmlns=""></Probability_TGS__c>
				<Pursue_date__c xmlns=""></Pursue_date__c>
				<Solution_Architect__c xmlns=""></Solution_Architect__c>
				<TGS_Oppty_Stage_at_Approval_Submission__c xmlns=""></TGS_Oppty_Stage_at_Approval_Submission__c>
				
				</sObjects>

		</create>
	</Body>
</Envelope>